#ifndef __USART_H
#define __USART_H


#include "stdio.h"	
#include "stm32f4xx_conf.h"


/********************************************************************************

//代码功能：串口 USART 1 驱动

//STM32F4工程模板-库函数版本
//DevEBox  0
//淘宝店铺：0
//淘宝店铺：0

*******************************************************************************/


void USART1_init(u32 bound);  //初始化串口1
void USART2_init(u32 bound);  //初始化串口2
void USART6_init(u32 bound);  //初始化串口6



#endif















/********************************************************************************

//代码功能：串口 USART 1 驱动

//STM32F4工程模板-库函数版本
//DevEBox  0
//淘宝店铺：0
//淘宝店铺：0

*******************************************************************************/



